# 251014 Day 35 of Python

# Day 23 Project
# Making the Capstone project - Turtle Crossing Game
# https://docs.python.org/3/library/turtle.html
# 순서 먼저 짜보기

# 화면 만들기 600 * 600 / Tracer(0) update(0.05)
# 거북이 만들기 - 위로만 올라가게 하기
# 자동차 만들기 - 좌 <- 우 랜덤위치, 랜덤색상
# 레벨 - 맨 위 도착하면 원위치 , update값 * 0.9 이런식으로 
# 충돌시 종료

# 1. 화면의 아래쪽에서부터 출발하는 거북이를 만들어 
#    “위” 키가 입력되면 북쪽으로 움직이세요. 
#    풀다가 막히면 3단계 설명 영상을 확인해 보세요.

# 2. 높이 20픽셀, 너비 40픽셀인 자동차들을 y축 범위 내에서 
#    무작위로 생성하고, 화면의 왼쪽 가장자리로 움직이세요. 
#    자동차는 화면의 위아래 가장자리에서 50픽셀 이상 띄워서 
#    생성해야 합니다(거북이를 위한 안전지대라고 생각하세요). 
#    힌트) 게임 반복문이 6번 실행될 때마다 자동차를 새로 생성하세요. 
#    풀다가 막히면 4단계 설명 영상을 확인해 보세요.

# 3. 거북이와 자동차의 충돌이 감지되면 게임을 멈추세요. 
#    풀다가 막히면, 5단계 설명 영상을 확인해 보세요.

# 4. 거북이가 화면의 위쪽 가장자리(즉, FINISH_LINE_Y)에 
#    도달했는지 감지하고, 도달했다면 거북이를 시작 위치로 
#    다시 보내고 자동차의 속도를 올리세요. 
#    힌트) MOVE_INCREMENT 속성을 만들어서 자동차 속도를 증가시켜 보세요. 
#    풀다가 막히면, 6단계 풀이 영상을 확인해 보세요.

# 5. 현재 게임 레벨을 보여주는 점수판을 만드세요. 
#    거북이가 성공적으로 길을 건널 때마다 레벨이 올라갑니다. 
#    거북이와 자동차가 부딪히면 화면 중앙에 ‘게임 종료’가 
#    표시되어야 합니다. 
#    풀다가 막히면, 7단계 설명 영상을 확인해 보세요.



